In [1]:
import pandas as pd

In [2]:
l1 = [1,2,3,4]
s1 = pd.Series(l1,index=["i","ii","iii","iv"],dtype="float",name="Python")
print(s1)
print(type(s1))

i      1.0
ii     2.0
iii    3.0
iv     4.0
Name: Python, dtype: float64
<class 'pandas.core.series.Series'>

In [5]:
dic = {"name":["python","c","c++","java"],"pop":[12,13,14,15],"rank":[1,4,3,2]}
s2 = pd.Series(dic)
print(s2)

name    [python, c, c++, java]
pop           [12, 13, 14, 15]
rank              [1, 4, 3, 2]
dtype: object

In [6]:
s = pd.Series([12,13,14,15,16,17,18],index=["i","ii","iii","iv","v","vi","vii"])
print(s)

i      12
ii     13
iii    14
iv     15
v      16
vi     17
vii    18
dtype: int64

In [7]:
s1 = pd.Series(12,index=["i","ii","iii","iv","v","vi","vii"])
s2 = pd.Series(12,index=["i","ii","iii","iv"])
print(s1)
print(s2)
print(s1+s2)

i      12
ii     12
iii    12
iv     12
v      12
vi     12
vii    12
dtype: int64
i      12
ii     12
iii    12
iv     12
dtype: int64
i      24.0
ii     24.0
iii    24.0
iv     24.0
v       NaN
vi      NaN
vii     NaN
dtype: float64

DataFrame

In [9]:
l = [1,2,3,4,5,6]
x = pd.DataFrame(l)
print(x)

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [10]:
dict1 = {"a":[1,2,3,4],"b":[5,6,7,8],"c":[9,10,11,12]}
df1 = pd.DataFrame(dict1,columns = ["a","c"],index = ["i","ii","iii","iv"])
print(df1)
print(df1["a"]["ii"])

     a   c
i    1   9
ii   2  10
iii  3  11
iv   4  12
2

In [11]:
df1

     a   c
i    1   9
ii   2  10
iii  3  11
iv   4  12

In [12]:
var = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})
var

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [13]:
var.insert(1,"python",[10,20,30,45,50])
var

   A  python  B
0  1      10  9
1  2      20  8
2  3      30  7
3  4      45  6
4  5      50  5

In [14]:
var.insert(0,"java",[10,12,14,16,18])
var

   java  A  python  B
0    10  1      10  9
1    12  2      20  8
2    14  3      30  7
3    16  4      45  6
4    18  5      50  5

In [15]:
var["JS"] = var["A"][0:3]
var

   java  A  python  B   JS
0    10  1      10  9  1.0
1    12  2      20  8  2.0
2    14  3      30  7  3.0
3    16  4      45  6  NaN
4    18  5      50  5  NaN

In [ ]:
var2 = var.pop("B")
var2

In [19]:
var

   java  A  python   JS
0    10  1      10  1.0
1    12  2      20  2.0
2    14  3      30  3.0
3    16  4      45  NaN
4    18  5      50  NaN

In [ ]:
c = [1,2,3,4,5,"ok"]
csv_data = pd.DataFrame(c)
csv_data.to_csv("csv_file.csv")

In [ ]:
c = [1,2,3,4,5,"ok"]
csv_data = pd.DataFrame(c)
csv_data.to_csv("csv_file1.csv",index=False)

In [21]:
d = pd.read_csv("C:\\Users\\Lenovo\\Downloads\\csv_file.csv")
d

   Unnamed: 0   0
0           0   1
1           1   2
2           2   3
3           3   4
4           4   5
5           5  ok

In [24]:
e = pd.read_csv("C:\\Users\\Lenovo\\Downloads\\csv_file.csv",nrows = 2,usecols=[1])
e

   0
0  1
1  2